# 2. DataFrame
2차원 데이터(Series 데이터의 모음)

## Data 준비
사전(dict) 자료형을 통해 생성

In [6]:
data = {
    '이름' : ['김자바', '이자바', '박자바', '최자바', '정자바'],
    '학급' : ['자바반', '자바반', '자바반', '캐드반', '캐드반'],
    '국어점수' : [90, 80, 70, 100, 90],
    '영어점수' : [70, 80, 80, 70, 90],
    '평균' : [80.0, 80.0, 75.0, 85.0, 90.0],
    '취미' : ['독서', '', '', '요가', '축구']
}
data

{'이름': ['김자바', '이자바', '박자바', '최자바', '정자바'],
 '학급': ['자바반', '자바반', '자바반', '캐드반', '캐드반'],
 '국어점수': [90, 80, 70, 100, 90],
 '영어점수': [70, 80, 80, 70, 90],
 '평균': [80.0, 80.0, 75.0, 85.0, 90.0],
 '취미': ['독서', '', '', '요가', '축구']}

## DataFrame 객체 생성

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    이름   학급  국어점수  영어점수    평균  취미
0  김자바  자바반    90    70  80.0  독서
1  이자바  자바반    80    80  80.0
2  박자바  자바반    70    80  75.0
3  최자바  캐드반   100    70  85.0  요가
4  정자바  캐드반    90    90  90.0  축구

### 데이터 접근

In [11]:
df['이름']

0    김자바
1    이자바
2    박자바
3    최자바
4    정자바
Name: 이름, dtype: object

In [12]:
df[['이름', '평균']]

    이름    평균
0  김자바  80.0
1  이자바  80.0
2  박자바  75.0
3  최자바  85.0
4  정자바  90.0

###  DataFrame 객체 생성 + Index 지정

In [13]:
# 데이터의 개수만큼 index를 지정!
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번'])

In [14]:
df

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  75.0
4번  최자바  캐드반   100    70  85.0  요가
5번  정자바  캐드반    90    90  90.0  축구

###  DataFrame 생성 + Column 지정
data 중에서 원하는 정보만 선택, 순서 변경도 가능

In [18]:
df = pd.DataFrame(data, columns=['이름', '학급', '평균'])
df

    이름   학급    평균
0  김자바  자바반  80.0
1  이자바  자바반  80.0
2  박자바  자바반  75.0
3  최자바  캐드반  85.0
4  정자바  캐드반  90.0